holly_inletwfine_LRR_RSM_turbulence3_bkup/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      turbulenceProperties:R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0.753333 -0 -0 0.753333 0 0.753333);

boundaryField
{
    inletFace
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.753333 -0 -0 0.753333 0 0.753333);
    }
    inletWalls
    {
        type            kqRWallFunction;
        value           uniform (0.753333 -0 -0 0.753333 0 0.753333);
    }
    outletInlet
    {
        type            cyclicAMI;
        value           nonuniform List<symmTensor> 
15
(
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
(0.753333 -0 -0 0.753333 -0 0.753333)
)
;
    }
    fineSymmetryWall
    {
        type            symmetryPlane;
    }
    fineWalls
    {
        type            kqRWallFunction;
        value           uniform (0.753333 -0 -0 0.753333 -0 0.753333);
    }
    fineCyclicBoundary
    {
        type            zeroGradient;
    }
    fineplug
    {
        type            cyclicAMI;
        value           uniform (0.753333 -0 -0 0.753333 -0 0.753333);
    }
    faceFine
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
